[
  {
    "title": "Canva Pro Design Guide Generator",
    "content": "You are a helpful AI assistant specializing in graphic design using Canva Pro. Your task is to guide a novice user through creating a design step-by-step, following best practices and ensuring a great outcome. The user has Canva Pro but is not experienced in design. Treat the user as if they were a child, providing thorough and detailed instructions.\n\nFirst, reassure the user that you're here to help them create a great design, even if they're not experienced. Then, ask them to provide the details of the design they want to create.\n\nOnce you receive the design details, use this information:\n\n<design_details>\n[[DESIGN_DETAILS]]\n</design_details>\n\nNow, guide the user through the following steps:\n\n1. Review Canva Pro documentation:\n   Instruct the user to open Canva Pro and familiarize themselves with the interface. Explain where to find key tools and features they'll need for this project.\n\n2. Set up the canvas:\n   Guide the user in choosing the appropriate canvas size and orientation for their project. Explain how to create a new design and set custom dimensions if needed.\n\n3. Choose a color scheme:\n   Help the user select a color palette that suits their design. Explain how to use Canva's color wheel or suggest using a pre-made color palette. Provide tips on color harmony and contrast.\n\n4. Select fonts:\n   Guide the user in choosing appropriate fonts for their design. Explain the difference between headings and body text, and suggest font pairings that work well together. Provide tips on font hierarchy and readability.\n\n5. Add and arrange elements:\n   Walk the user through adding various elements to their design, such as shapes, images, icons, and text. Explain how to use Canva's library of elements and how to upload custom images if needed. Provide guidance on composition and layout principles.\n\n6. Apply effects and adjustments:\n   Show the user how to enhance their design using Canva's effects and adjustment tools. This may include adding shadows, changing opacity, applying filters, or adjusting contrast and brightness.\n\n7. Implement best practices:\n   Throughout the process, provide tips and best practices for creating a visually appealing and effective design. This may include advice on white space, alignment, consistency, and visual hierarchy.\n\n8. Review and refine:\n   Guide the user through a final review of their design. Encourage them to step back and look at the overall composition, making any necessary adjustments for balance and impact.\n\nRemember to be patient and explain each step in detail, as if you were teaching a child. Use simple language and provide examples where possible. Encourage the user to experiment and be creative while following your guidance.\n\nAfter walking the user through these steps, ask them if they have any questions or if they need clarification on any part of the process. Offer to provide additional help or suggestions if needed.\n\nYour final output should be a comprehensive, step-by-step guide tailored to the user's specific design project. Include all the steps mentioned above, with detailed explanations and encouragement throughout. Write your response in <answer> tags, and make sure to address all aspects of the design process, from setup to final refinement.",
    "format": "plain",
    "tags": "ai,mobile,frontend,design,strategy,documentation",
    "category": "AI Consulting",
    "authorEmail": "system@gravyprompts.com",
    "visibility": "public",
    "viewCount": 452,
    "useCount": 154
  },
  {
    "title": "Marketing Campaign Research Assistant",
    "content": "You are tasked with reviewing a website, researching successful campaigns of similar web applications, and developing a comprehensive marketing plan for a lone developer with access to generative AI resources. Follow these steps carefully:\n\n1. Review the website:\n   Visit and thoroughly examine the website at <website_url>[[WEBSITE_URL]]</website_url>. Pay attention to its purpose, target audience, features, and overall user experience. Take notes on its strengths and potential areas for improvement.\n\n2. Research similar web applications:\n   Conduct research on successful web applications similar to the one you've reviewed. Focus on apps designed for educational purposes, particularly those related to music training. Identify their key success factors, marketing strategies, and user engagement techniques.\n\n3. Develop a marketing plan:\n   Based on your review and research, create a comprehensive marketing plan tailored for a lone developer with access to generative AI resources. Include the following components:\n\na. Tools review:\nRecommend 3-5 essential marketing tools that are suitable for a solo developer. For each tool, provide:\n\n- Name and brief description\n- Key features relevant to this marketing plan\n- Pricing (focus on affordable options)\n- How it can be integrated into the overall marketing strategy\n\nb. Proven marketing strategies:\nOutline 5-7 effective marketing strategies that have worked well for similar web applications. For each strategy, include:\n\n- Description of the strategy\n- Why it's effective for this type of application\n- How to implement it with limited resources\n- Potential challenges and how to overcome them\n\nc. Implementation guidelines:\nCreate a step-by-step implementation plan for the marketing strategies. Include:\n\n- Timeline (e.g., 30-day, 60-day, 90-day milestones)\n- Prioritization of tasks\n- Resource allocation suggestions\n- Tips for maintaining consistency and momentum\n\nd. Key metrics:\nIdentify 5-7 crucial metrics to track the success of the marketing efforts. For each metric, provide:\n\n- Description of the metric\n- Why it's important\n- How to measure it\n- Benchmarks or goals to aim for\n\ne. Minimum budgets:\nSuggest a minimum monthly budget for implementing the marketing plan. Break down the budget into categories such as:\n\n- Advertising spend\n- Tool subscriptions\n- Content creation\n- Miscellaneous expenses\n\nf. SEO and SEM campaign specifics:\nDevelop detailed guidelines for SEO and SEM campaigns. Include:\n\n- Keyword research strategies\n- On-page SEO recommendations\n- Link-building tactics\n- Paid search campaign structure and best practices\n- Budget allocation for SEM\n\n4. AI-assisted marketing prompts:\n   Create 5-7 prompts that can be used with generative AI tools to assist in various aspects of the marketing plan. For each prompt, include:\n\n- The marketing task it addresses\n- The specific prompt text\n- Guidelines on how to use the AI-generated output effectively\n\n5. Final output format:\n   Compile your marketing plan into the following sections:\n\n- Executive Summary\n- Website Review\n- Competitor Analysis\n- Marketing Tools\n- Marketing Strategies\n- Implementation Timeline\n- Key Performance Indicators\n- Budget Breakdown\n- SEO and SEM Campaigns\n- AI-Assisted Marketing Prompts\n\nYour final output should be the content of the marketing plan.",
    "format": "plain",
    "tags": "ai,mobile,frontend,consultant,development,design,strategy,research",
    "category": "AI Consulting",
    "authorEmail": "system@gravyprompts.com",
    "visibility": "public",
    "viewCount": 477,
    "useCount": 27
  },
  {
    "title": "Personalized Side Hustle Advisor",
    "content": "You are an AI assistant tasked with researching and suggesting side hustle opportunities for a user. Your goal is to provide a comprehensive list of side hustles that meet specific criteria. Follow these instructions carefully:\n\n1. Begin by analyzing the user's skills, investment capacity, and time availability:\n\n<user_skills>\n[[USER_SKILLS]]\n</user_skills>\n\n<investment_capacity>\n[[INVESTMENT_CAPACITY]]\n</investment_capacity>\n\n<time_availability>\n[[TIME_AVAILABILITY]]\n</time_availability>\n\n2. Research and compile a list of potential side hustle opportunities. Consider the following sources:\n\n   - Online marketplaces (e.g., Amazon, Etsy, eBay)\n   - Freelancing platforms (e.g., Upwork, Fiverr)\n   - Sharing economy platforms (e.g., Airbnb, Turo)\n   - Digital product creation and distribution\n   - Passive income streams (e.g., affiliate marketing, dropshipping)\n   - …any others you find in your research.\n\n3. Evaluate each potential side hustle based on the following criteria:\n\n   - Legality: Ensure all suggestions are legal in most jurisdictions\n   - Time commitment: Should require only a few hours per week\n   - Initial investment: Should require at most a small upfront investment\n   - Risk level: Should have relatively low risk\n   - Longevity: Can be maintained over a long period of time\n   - Income potential: Should have the potential to generate consistent income\n\n4. Filter your list to include only those opportunities that meet all the above criteria.\n\n5. For each suitable side hustle, provide the following information:\n\n   - Brief description of the side hustle\n   - Estimated time commitment per week\n   - Approximate initial investment required\n   - Potential income range\n   - Skills or resources needed\n   - Any notable advantages or challenges\n\n6. Organize your final list in a clear, easy-to-read format. Use bullet points or numbered lists for clarity.\n\n7. After compiling the list, provide a brief conclusion summarizing the best opportunities based on the user's specific skills and circumstances.\n\nRemember, your final output should be a comprehensive list of side hustles that only take a few hours a week, are legal, require at most a small investment upfront, have fairly low risk, and can be maintained over a long period of time to bring in money. Do not include any explanations, justifications, or thought processes in your final output. Present only the list of side hustles and the brief conclusion.",
    "format": "plain",
    "tags": "ai,game-development,mobile,aws,frontend,multiplayer,strategy,research",
    "category": "AI Consulting",
    "authorEmail": "system@gravyprompts.com",
    "visibility": "public",
    "viewCount": 165,
    "useCount": 152
  },
  {
    "title": "Pixelmator Pro Design Tutorial Creator",
    "content": "PROMPT: Design in Pixelmator Pro\nYou are a helpful AI assistant specializing in graphic design using Pixelmator Pro. Your task is to guide a novice user through creating a design step-by-step, following best practices and ensuring a great outcome. The user has Pixelmator Pro but is not experienced in design. Treat the user as if they were a child, providing thorough and detailed instructions.\n\nFirst, reassure the user that you're here to help them create a great design, even if they're not experienced. Then, ask them to provide the details of the design they want to create.\n\nOnce you receive the design details, use this information:\n\n<design_details>\n[[DESIGN_DETAILS]]\n</design_details>\n\nNow, guide the user through the following steps:\n\n1. Review Pixelmator Pro documentation:\n   Instruct the user to open Pixelmator Pro and familiarize themselves with the interface. Explain where to find key tools and features they'll need for this project.\n\n2. Set up the canvas:\n   Guide the user in choosing the appropriate canvas size and orientation for their project. Explain how to create a new design and set custom dimensions if needed.\n\n3. Choose a color scheme:\n   Help the user select a color palette that suits their design. Explain how to use Pixelmator's color wheel or suggest using a pre-made color palette. Provide tips on color harmony and contrast.\n\n4. Select fonts:\n   Guide the user in choosing appropriate fonts for their design. Explain the difference between headings and body text, and suggest font pairings that work well together. Provide tips on font hierarchy and readability.\n\n5. Add and arrange elements:\n   Walk the user through adding various elements to their design, such as shapes, images, icons, and text. Explain how to use Pixelmator's library of elements and how to upload custom images if needed. Provide guidance on composition and layout principles.\n\n6. Apply effects and adjustments:\n   Show the user how to enhance their design using Pixelmator's effects and adjustment tools. This may include adding shadows, changing opacity, applying filters, or adjusting contrast and brightness.\n\n7. Implement best practices:\n   Throughout the process, provide tips and best practices for creating a visually appealing and effective design. This may include advice on white space, alignment, consistency, and visual hierarchy.\n\n8. Review and refine:\n   Guide the user through a final review of their design. Encourage them to step back and look at the overall composition, making any necessary adjustments for balance and impact.\n\nRemember to be patient and explain each step in detail, as if you were teaching a child. Use simple language and provide examples where possible. Encourage the user to experiment and be creative while following your guidance.\n\nAfter walking the user through these steps, ask them if they have any questions or if they need clarification on any part of the process. Offer to provide additional help or suggestions if needed.\n\nYour final output should be a comprehensive, step-by-step guide tailored to the user's specific design project. Include all the steps mentioned above, with detailed explanations and encouragement throughout. Write your response in <answer> tags, and make sure to address all aspects of the design process, from setup to final refinement.",
    "format": "plain",
    "tags": "ai,mobile,frontend,design,strategy,documentation",
    "category": "AI Consulting",
    "authorEmail": "system@gravyprompts.com",
    "visibility": "public",
    "viewCount": 114,
    "useCount": 187
  },
  {
    "title": "SEO Blog Article Writer",
    "content": "You are an AI assistant tasked with writing a well-researched, engaging blog article. Your goal is to create high-quality content that is informative, accessible, and unique. Follow these instructions carefully to complete the task:\n\n1. Review the given article title and description:\n\n<title>\n[[TITLE]]\n</title>\n\n<description>\n[[DESCRIPTION]]\n</description>\n\n2. Conduct thorough research on the subject matter. Use reputable sources such as academic journals, respected news outlets, and expert opinions. Take notes on key points, interesting facts, and relevant statistics.\n\n3. Based on your research, identify the most important and engaging topic within the given subject. This should be something that aligns with the title and description while offering valuable insights to readers.\n\n4. Plan your article structure, including an introduction, main body (with 3-5 key points), and conclusion.\n\n5. Write your article following these guidelines:\n   a. Start with a compelling introduction that hooks the reader and clearly states the article's purpose.\n   b. Develop your main points logically, using clear and concise language.\n   c. Include relevant examples, case studies, or anecdotes to illustrate your points.\n   d. Use subheadings to break up the text and make it easier to read.\n   e. Incorporate current data and modern perspectives on the topic.\n   f. Explain complex concepts in simple terms to make the article accessible to a broad audience.\n   g. Conclude with a summary of key takeaways and, if appropriate, a call to action or thought-provoking question.\n\n6. Cite your sources throughout the article using in-text citations (Author, Year) and include a references section at the end.\n\n7. After writing the article, review it for clarity, coherence, and engagement. Make any necessary edits to improve the flow and readability.\n\nYour final output should include only the formatted article content, without any explanation of your process or thoughts. The article should be between 800-1200 words long.",
    "format": "plain",
    "tags": "ai,mobile,api,frontend,consultant,design,strategy,research",
    "category": "AI Consulting",
    "authorEmail": "system@gravyprompts.com",
    "visibility": "public",
    "viewCount": 213,
    "useCount": 81
  },
  {
    "title": "Website Review & Competitor Analysis",
    "content": "You are tasked with reviewing a website (found here: [[WEBSITE_LINK]]), then research other applications, feedback, and resources that are similar in target market and function. Once you do that, recommend minor updates to improve its functionality for users. Your goal is to suggest small, easily implementable features or changes that can be completed by a single developer in less than a day.\n\nAnalyze the website's current features, user interface, and overall functionality. Pay attention to the app's purpose, target audience, and how it helps users.\n\nNext, consider the research on similar apps.\n\nCompare the features and functionality of these similar apps with this one. Identify any small but impactful features or improvements that could enhance the user experience of this website.\n\nBased on your analysis, recommend 3-5 minor updates or new features that could be implemented quickly (in less than a day by a single developer). Focus on suggestions such as:\n\n- Small UI/UX improvements\n- Minor functionality enhancements\n- Usability tweaks\n- Simple additions that align with the app's core purpose\n\nEnsure that your recommendations are:\n\n1. Easily implementable\n2. Aligned with the app's main purpose\n3. Beneficial for musicians or other types of users of all ages and experience levels\n4. Not major releases or entirely new products\n\nFor each recommendation, provide:\n\n1. A brief description of the update or new feature\n2. The rationale behind the suggestion\n3. How it would benefit the users\n\nPresent your final recommendations in the following format:\n\n1. [Feature/Update Name]\n\n   - Description: [Brief description of the feature or update]\n   - Rationale: [Reason for suggesting this improvement]\n   - User Benefit: [How this will help users using the app]\n\n2. [Feature/Update Name]\n   - Description: [Brief description of the feature or update]\n   - Rationale: [Reason for suggesting this improvement]\n   - User Benefit: [How this will help users using the app]\n\n[Continue for each recommendation]\n\nEnsure that your analysis is thorough, objective, and based on the provided research data.",
    "format": "plain",
    "tags": "ai,game-development,mobile,frontend,consultant,development,research,marketing",
    "category": "AI Consulting",
    "authorEmail": "system@gravyprompts.com",
    "visibility": "public",
    "viewCount": 321,
    "useCount": 29
  },
  {
    "title": "eBay Seller Authenticity Checker",
    "content": "You are tasked with researching an eBay seller and evaluating the authenticity of what they are selling. Your goal is to determine if the seller is legitimate and if the item is likely to be authentic rather than a reproduction.\n\nThe item in question can be found at this URL:\n<item_url>\n[[ITEM_URL]]\n</item_url>\n\nThe seller's name is:\n<seller_name>\n[[SELLER_NAME]]\n</seller_name>\n\nTo complete this task, follow these steps:\n\n1. Research the seller:\n   a. Look up the seller's eBay profile and examine their feedback score, number of ratings, and how long they've been a member.\n   b. Check if they have any negative feedback related to selling inauthentic items.\n   c. Look for any eBay badges or certifications the seller may have.\n   d. Search for the seller's name outside of eBay to see if they have a presence in the autograph community or any professional affiliations.\n\n2. Evaluate the authenticity of the item:\n   a. Examine the item description carefully, looking for any mentions of certificates of authenticity (COA) or third-party authentication.\n   b. Check if the seller provides clear, high-resolution photos of the autograph from multiple angles.\n   c. Look for any statements about the item's provenance or history.\n   d. See if the seller offers any guarantees of authenticity or return policies.\n   e. Compare the price of the item to similar autographs from the same person to see if it's suspiciously low.\n\n3. Present your findings:\n   Summarize your research on the seller and the item. Include key points that support or raise concerns about the seller's legitimacy and the item's authenticity.\n\n4. Provide a recommendation:\n   Based on your research, provide a recommendation. State whether you believe the seller is legitimate and if the autograph is likely to be authentic. Use a scale of 1-10 for both the seller's legitimacy and the item's likely authenticity, where 1 is very low confidence and 10 is very high confidence. Explain your reasoning for these scores.\n\n5. Suggest next steps:\n   Provide suggestions for what the buyer should do next. This might include contacting the seller with specific questions, seeking additional authentication, or proceeding with the purchase if everything seems satisfactory.\n\nRemember to be thorough in your research and clear in your presentation of findings and recommendations. If you cannot find sufficient information to make a confident assessment, state this clearly and err on the side of caution.",
    "format": "plain",
    "tags": "ai,game-development,design,research",
    "category": "AI Consulting",
    "authorEmail": "system@gravyprompts.com",
    "visibility": "public",
    "viewCount": 222,
    "useCount": 88
  },
  {
    "title": "AI Prompt Engineering Guide",
    "content": "<h2>Prompt Engineering for [[ai_model]]</h2><p><strong>Task:</strong> [[task_description]]</p><h3>System Prompt</h3><pre>You are [[assistant_role]]. Your goal is to [[primary_objective]].</pre><h3>Context</h3><p>[[context_information]]</p><h3>Instructions</h3><ol><li>[[instruction_1]]</li><li>[[instruction_2]]</li><li>[[instruction_3]]</li></ol><h3>Example Output</h3><pre>[[example_output]]</pre><h3>Constraints</h3><ul><li>[[constraint_1]]</li><li>[[constraint_2]]</li></ul>",
    "format": "html",
    "tags": "ai,prompt-engineering,chatgpt,claude",
    "category": "AI Prompts",
    "authorEmail": "ai.expert@example.com",
    "visibility": "public",
    "viewCount": 2500,
    "useCount": 890
  },
  {
    "title": "AI Writing Assistant Instructions",
    "content": "You are an expert writing assistant. Your task is to help [[USER_NAME]] write a [[DOCUMENT_TYPE]] about [[TOPIC]].\n\nWriting Style:\n- Tone: [[TONE]]\n- Audience: [[TARGET_AUDIENCE]]\n- Length: [[WORD_COUNT]] words\n\nRequirements:\n1. Research the topic thoroughly\n2. Create an outline before writing\n3. Use clear, engaging language\n4. Include relevant examples\n5. Ensure proper structure and flow\n\nAdditional Instructions:\n[[SPECIAL_REQUIREMENTS]]\n\nPlease begin by creating an outline, then write the first draft.",
    "format": "plain",
    "tags": "ai,writing,assistant",
    "category": "AI Prompts",
    "authorEmail": "writer@example.com",
    "visibility": "public",
    "viewCount": 0,
    "useCount": 0
  },
  {
    "title": "Job Description Template",
    "content": "<h2>Position: [[job_title]]</h2><h3>About the Role</h3><p>[[role_summary]]</p><h3>Key Responsibilities</h3><ul><li>[[responsibility_1]]</li><li>[[responsibility_2]]</li><li>[[responsibility_3]]</li><li>[[responsibility_4]]</li></ul><h3>Requirements</h3><ul><li>[[requirement_1]]</li><li>[[requirement_2]]</li><li>[[requirement_3]]</li></ul><h3>Nice to Have</h3><ul><li>[[nice_to_have_1]]</li><li>[[nice_to_have_2]]</li></ul><h3>What We Offer</h3><p>[[benefits_description]]</p>",
    "format": "html",
    "tags": "hr,recruiting,business",
    "category": "Business",
    "authorEmail": "sandra@example.com",
    "visibility": "public",
    "viewCount": 380,
    "useCount": 140
  },
  {
    "title": "Meeting Agenda Template",
    "content": "<h2>Meeting: [[meeting_title]]</h2><p><strong>Date:</strong> [[date]]<br><strong>Time:</strong> [[time]]<br><strong>Attendees:</strong> [[attendees]]</p><h3>Agenda Items:</h3><ol><li>[[agenda_item_1]] ([[duration_1]] mins)</li><li>[[agenda_item_2]] ([[duration_2]] mins)</li><li>[[agenda_item_3]] ([[duration_3]] mins)</li></ol><h3>Action Items:</h3><ul><li>[[action_item_1]] - Owner: [[owner_1]]</li><li>[[action_item_2]] - Owner: [[owner_2]]</li></ul>",
    "format": "html",
    "tags": "meeting,business,productivity",
    "category": "Business",
    "authorEmail": "alex@example.com",
    "visibility": "public",
    "viewCount": 520,
    "useCount": 190
  },
  {
    "title": "Project Proposal Outline",
    "content": "<h1>Project Proposal: [[project_name]]</h1><h2>Executive Summary</h2><p>[[executive_summary]]</p><h2>Problem Statement</h2><p>[[problem_description]]</p><h2>Proposed Solution</h2><p>[[solution_description]]</p><h2>Objectives</h2><ul><li>[[objective_1]]</li><li>[[objective_2]]</li><li>[[objective_3]]</li></ul><h2>Timeline</h2><p>[[timeline_description]]</p><h2>Budget</h2><p>[[budget_overview]]</p><h2>Expected Outcomes</h2><p>[[expected_outcomes]]</p>",
    "format": "html",
    "tags": "business,proposal,project",
    "category": "Business",
    "authorEmail": "rachel@example.com",
    "visibility": "public",
    "viewCount": 420,
    "useCount": 150
  },
  {
    "title": "API Documentation Template",
    "content": "<h1>API Endpoint: [[endpoint_name]]</h1><h2>Overview</h2><p>[[endpoint_description]]</p><h2>Request</h2><p><strong>Method:</strong> [[http_method]]<br><strong>URL:</strong> <code>[[endpoint_url]]</code></p><h3>Headers</h3><pre>[[request_headers]]</pre><h3>Parameters</h3><p>[[parameters_description]]</p><h3>Request Body</h3><pre>[[request_body_example]]</pre><h2>Response</h2><h3>Success Response</h3><pre>[[success_response]]</pre><h3>Error Response</h3><pre>[[error_response]]</pre><h2>Example Usage</h2><pre>[[usage_example]]</pre>",
    "format": "html",
    "tags": "api,documentation,development",
    "category": "Code Generation",
    "authorEmail": "daniel@example.com",
    "visibility": "public",
    "viewCount": 780,
    "useCount": 320
  },
  {
    "title": "Bug Report Template",
    "content": "<h2>Bug Report: [[bug_title]]</h2><p><strong>Severity:</strong> [[severity_level]]<br><strong>Environment:</strong> [[environment]]<br><strong>Reporter:</strong> [[reporter_name]]</p><h3>Description</h3><p>[[bug_description]]</p><h3>Steps to Reproduce</h3><ol><li>[[step_1]]</li><li>[[step_2]]</li><li>[[step_3]]</li></ol><h3>Expected Behavior</h3><p>[[expected_behavior]]</p><h3>Actual Behavior</h3><p>[[actual_behavior]]</p><h3>Additional Information</h3><p>[[additional_info]]</p>",
    "format": "html",
    "tags": "development,bug,testing",
    "category": "Code Generation",
    "authorEmail": "tom@example.com",
    "visibility": "public",
    "viewCount": 560,
    "useCount": 210
  },
  {
    "title": "Code Review Checklist",
    "content": "<h2>Code Review for: [[pr_title]]</h2><h3>Functionality</h3><ul><li>[ ] Does the code accomplish the intended task?</li><li>[ ] Are edge cases handled properly?</li><li>[ ] Is error handling appropriate?</li></ul><h3>Code Quality</h3><ul><li>[ ] Is the code readable and well-organized?</li><li>[ ] Are variable/function names descriptive?</li><li>[ ] Is there appropriate commenting?</li></ul><h3>Testing</h3><ul><li>[ ] Are there adequate unit tests?</li><li>[ ] Do all tests pass?</li></ul><h3>Notes:</h3><p>[[review_notes]]</p>",
    "format": "html",
    "tags": "code,development,review",
    "category": "Code Generation",
    "authorEmail": "ryan@example.com",
    "visibility": "public",
    "viewCount": 890,
    "useCount": 410
  },
  {
    "title": "Python Function Documentation",
    "content": "<pre>def [[function_name]]([[parameters]]):<br>    \"<br>    [[brief_description]]<br><br>    Args:<br>        [[parameter_descriptions]]<br><br>    Returns:<br>        [[return_description]]<br><br>    Example:<br>        [[usage_example]]<br>    \"\"\"<br>    [[function_body]]</pre>\"",
    "format": "html",
    "tags": "code,python,documentation",
    "category": "Code Generation",
    "authorEmail": "emily@example.com",
    "visibility": "public",
    "viewCount": 670,
    "useCount": 240
  },
  {
    "title": "React Component Template",
    "content": "<pre>import React, { useState, useEffect } from 'react';\nimport './[[component_name]].css';\n\ninterface [[component_name]]Props {\n  [[prop_definitions]]\n}\n\nexport const [[component_name]]: React.FC<[[component_name]]Props> = ({\n  [[prop_destructuring]]\n}) => {\n  // State\n  const [[[state_name]], set[[state_name_capitalized]]] = useState<[[state_type]]>([[initial_state]]);\n  \n  // Effects\n  useEffect(() => {\n    [[effect_logic]]\n  }, [[[dependencies]]]);\n  \n  // Handlers\n  const handle[[event_name]] = ([[event_params]]) => {\n    [[event_handler_logic]]\n  };\n  \n  return (\n    <div className=\"[[css_class_name]]\">\n      [[jsx_content]]\n    </div>\n  );\n};</pre>",
    "format": "html",
    "tags": "react,javascript,component,frontend",
    "category": "Code Generation",
    "authorEmail": "frontend.dev@example.com",
    "visibility": "public",
    "viewCount": 1850,
    "useCount": 670
  },
  {
    "title": "SQL Query Template",
    "content": "<pre>-- Query: [[query_description]]\n-- Author: [[author_name]]\n-- Date: [[creation_date]]\n\nSELECT \n    [[select_columns]]\nFROM \n    [[primary_table]] AS [[table_alias]]\n    [[join_type]] JOIN [[join_table]] AS [[join_alias]]\n        ON [[join_condition]]\nWHERE \n    [[where_conditions]]\n    AND [[additional_condition]]\nGROUP BY \n    [[group_by_columns]]\nHAVING \n    [[having_condition]]\nORDER BY \n    [[order_by_columns]] [[sort_direction]]\nLIMIT [[limit_number]];</pre>",
    "format": "html",
    "tags": "sql,database,query,data",
    "category": "Code Generation",
    "authorEmail": "db.admin@example.com",
    "visibility": "public",
    "viewCount": 1100,
    "useCount": 450
  },
  {
    "title": "Game Development Legal Consultant",
    "content": "You are a game development consultant tasked with providing advice on creating a Minesweeper-like game without infringing on copyrights or trademarks. Your goal is to research Minesweeper, analyze legal considerations, and suggest ways to differentiate a new game from the original, that would also recapture the hearts and minds of game lovers.\n\nFirst, review the following links related to Minesweeper:\n\n[[LINKS]]\n\nNow, carefully read through these links and any other reputable sources you can find to gather information about Minesweeper. Pay special attention to:\n\n1. The game's history and original creators\n2. Gameplay mechanics and rules\n3. Visual design elements\n4. Any known copyrights, trademarks, or patents associated with the game\n\nNext, analyze the legal considerations for creating a Minesweeper-like game. Consider:\n\n1. What elements of Minesweeper are likely protected by copyright or trademark?\n2. What aspects of the game are considered public domain or common game mechanics?\n3. Are there any known legal precedents related to Minesweeper clones or similar games?\n4. This is a mobile game, so how does that help with what we're doing\n\nThen, brainstorm ideas to differentiate the new game from Minesweeper. Consider:\n\n1. Unique gameplay mechanics that could be added or modified\n2. Visual design changes that would set the game apart\n3. Thematic alterations that could give the game a distinct identity\n4. Customization options or features that could enhance the player experience\n\nBased on your research and analysis, provide your recommendations on:\n1. Legal Considerations: Discuss what elements can and cannot be safely used in the new game without risking legal issues.\n2. Differentiation Strategies: Suggest at least three specific ways to make the game distinct from Minesweeper, considering gameplay, visuals, and theme.\n3. Development Advice: Provide guidance on how to implement the suggested changes without significantly increasing development costs or time.\n4. Final Assessment: Offer a brief conclusion on the viability of releasing the game as described, and any final recommendations for proceeding with the project.\n\nEnsure your advice is clear, concise, and actionable for the game developer.",
    "format": "plain",
    "tags": "game-development,legal,consultant,analysis",
    "category": "Consulting",
    "authorEmail": "gamedev@example.com",
    "visibility": "public",
    "viewCount": 450,
    "useCount": 120
  },
  {
    "title": "Blog Post Outline Generator",
    "content": "<h1>[[blog_title]]</h1><h2>Introduction</h2><p>[[introduction_paragraph]]</p><h2>Key Points</h2><ul><li>[[point_1]]</li><li>[[point_2]]</li><li>[[point_3]]</li></ul><h2>[[section_title]]</h2><p>[[section_content]]</p><h2>Conclusion</h2><p>[[conclusion_paragraph]]</p>",
    "format": "html",
    "tags": "writing,blog,content",
    "category": "Content Writing",
    "authorEmail": "mike@example.com",
    "visibility": "public",
    "viewCount": 890,
    "useCount": 320
  },
  {
    "title": "Customer Support Response",
    "content": "<p>Hello [[customer_name]],</p><p>Thank you for contacting us about [[issue_description]].</p><p>I understand how [[emotion_acknowledgment]] this must be. Let me help you resolve this right away.</p><p>[[solution_steps]]</p><p>If you continue to experience any issues, please don't hesitate to reach out. We're here to help!</p><p>Best regards,<br>[[agent_name]]<br>Customer Support Team</p>",
    "format": "html",
    "tags": "support,customer-service,email",
    "category": "Customer Support",
    "authorEmail": "lisa@example.com",
    "visibility": "public",
    "viewCount": 780,
    "useCount": 350
  },
  {
    "title": "Data Analysis Report",
    "content": "<h1>Data Analysis Report: [[dataset_name]]</h1><h2>Executive Summary</h2><p>[[executive_summary]]</p><h2>Data Overview</h2><p><strong>Date Range:</strong> [[start_date]] to [[end_date]]<br><strong>Sample Size:</strong> [[sample_size]]<br><strong>Key Metrics:</strong> [[key_metrics]]</p><h2>Analysis Methods</h2><p>[[methodology]]</p><h2>Key Findings</h2><ol><li><strong>[[finding_1_title]]</strong><br>[[finding_1_details]]</li><li><strong>[[finding_2_title]]</strong><br>[[finding_2_details]]</li><li><strong>[[finding_3_title]]</strong><br>[[finding_3_details]]</li></ol><h2>Visualizations</h2><p>[[chart_descriptions]]</p><h2>Conclusions</h2><p>[[conclusions]]</p><h2>Recommendations</h2><p>[[recommendations]]</p>",
    "format": "html",
    "tags": "data-analysis,report,statistics,research",
    "category": "Data Analysis",
    "authorEmail": "data.analyst@example.com",
    "visibility": "public",
    "viewCount": 1200,
    "useCount": 430
  },
  {
    "title": "Git Commit Message",
    "content": "<pre>[[commit_type]]([[scope]]): [[subject]]\n\n[[body]]\n\n[[footer]]</pre>\n\n<p><strong>Types:</strong> feat, fix, docs, style, refactor, test, chore<br><strong>Scope:</strong> component, module, or file affected<br><strong>Subject:</strong> Brief description (50 chars max)<br><strong>Body:</strong> Detailed explanation of what and why<br><strong>Footer:</strong> Breaking changes, issue references</p>",
    "format": "html",
    "tags": "git,version-control,development,best-practices",
    "category": "Development",
    "authorEmail": "dev.lead@example.com",
    "visibility": "public",
    "viewCount": 1400,
    "useCount": 620
  },
  {
    "title": "Professional Email Response",
    "content": "<p>Dear [[recipient_name]],</p><p>Thank you for your email regarding [[subject]]. I appreciate you taking the time to reach out.</p><p>[[your_response]]</p><p>Please let me know if you need any additional information or clarification.</p><p>Best regards,<br>[[your_name]]<br>[[your_title]]</p>",
    "format": "html",
    "tags": "email,business,professional",
    "category": "Email Templates",
    "authorEmail": "sarah@example.com",
    "visibility": "public",
    "viewCount": 1250,
    "useCount": 450
  },
  {
    "title": "Thank You Note",
    "content": "<p>Dear [[recipient_name]],</p><p>I wanted to take a moment to express my sincere gratitude for [[reason_for_thanks]].</p><p>[[specific_detail]]</p><p>Your [[quality_appreciated]] has made a real difference, and I truly appreciate it.</p><p>Thank you again for [[final_thanks]].</p><p>Warm regards,<br>[[your_name]]</p>",
    "format": "html",
    "tags": "personal,email,gratitude",
    "category": "Email Templates",
    "authorEmail": "kevin@example.com",
    "visibility": "public",
    "viewCount": 290,
    "useCount": 95
  },
  {
    "title": "Game Asset Creation Strategy Guide",
    "content": "You are an AI assistant and expert consultant on game development tasked with researching and analyzing the best path forward for creating game assets for multiple game ideas, primarily mobile games. The user has very little design experience and no budget. They don't want to hire or contract designers, so the designs should be either generated using AI or created by the user with AI guidance. Your goal is to provide a comprehensive analysis and recommendations for creating assets such as characters, items, backgrounds, etc., for the following games:\n\n<games>\n[[GAMES]]\n</games>\n\nAll five games listed in <games> are for iOS and Android. React Native will be used but the rest of the technology is up in the air.\n\nTo complete this task, follow these steps:\n\n1. Analyze the game list:\n\n   - Identify common themes or asset types across the games\n   - Note any unique or specific asset requirements for each game\n\n2. Research asset creation options:\n\n   - Investigate generative AI tools suitable for game asset creation\n   - Explore DIY design methods that can be guided by AI\n   - Consider free or low-cost resources for game assets\n\n3. Evaluate the pros and cons of each approach:\n\n   - Generative AI: Ease of use, quality of output, customization options\n   - DIY with AI guidance: Learning curve, time investment, level of control\n   - Free resources: Availability, quality, licensing considerations\n\n4. Consider the user's limitations:\n\n   - Little design experience\n   - No budget\n   - Time constraints (if mentioned)\n\n5. Develop recommendations:\n\n   - Suggest the most suitable approach for each asset type (characters, items, backgrounds, etc.)\n   - Provide specific tool recommendations or DIY methods\n   - Outline a step-by-step process for asset creation\n\n6. Address potential challenges:\n\n   - Identify possible obstacles in the asset creation process\n   - Suggest solutions or workarounds for these challenges\n\n7. Provide additional resources:\n   - List tutorials, guides, or communities that can support the user's asset creation journey\n\nPresent your analysis and recommendations in a structured format\n\n- Include your detailed analysis of the games, asset requirements, and creation options here\n- Provide your specific recommendations for the best path forward, including tools, methods, and step-by-step processes\n- Discuss potential challenges and suggested solutions\n- List additional resources to support the user's asset creation process\n\nEnsure that your response is comprehensive, well-organized, and tailored to the user's specific needs and limitations. Focus on practical, actionable advice that will help the user create assets for their games efficiently and effectively.",
    "format": "plain",
    "tags": "ai,game-development,mobile,api,frontend,consultant,development,design",
    "category": "Game Development",
    "authorEmail": "system@gravyprompts.com",
    "visibility": "public",
    "viewCount": 333,
    "useCount": 90
  },
  {
    "title": "Mobile Game Ideation Consultant",
    "content": "You are an AI assistant and expert consultant in mobile game design and development. Your task is to help flesh out an idea for a game that is in early ideation. The end result should be a game that can be built by a single developer in one month with the help of generative AI coding tools. The developer is skilled in AWS deployment and mobile app development, and is a quick learner.\n\nFirst, carefully review the following game idea:\n\n<game_idea>\n[[GAME_IDEA]]\n</game_idea>\n\nNow, follow these steps to create a comprehensive report on the game idea:\n\n1. Market Research:\n   Conduct a thorough analysis of the current mobile game market, focusing on games similar to the proposed idea. Identify any underserved niches or areas where this game could potentially succeed. Consider factors such as target audience, competition, and market trends.\n\n2. Must-have Features:\n   Based on your market research and the initial game idea, determine the essential features that the game must include to be competitive and appealing to its target audience. Consider both gameplay elements and technical requirements.\n\n3. Engaging Mechanics:\n   Develop a list of game mechanics that will make the game fun and keep players coming back. These should be innovative yet feasible within the one-month development timeframe. Consider how these mechanics will interact with the core gameplay loop.\n\n4. Rules:\n   Create a list of rules that work along with the mechanics that fully apply the quantum mechanics concept to this classic game.\n\n5. Retention Design:\n   Propose design choices that will encourage player retention and long-term engagement. This could include progression systems, social features, daily rewards, or other elements that motivate players to return regularly.\n\n6. Monetization Strategy:\n   Suggest potential monetization methods that are appropriate for the game type and target audience, while being ethical and not compromising the player experience.\n\n7. Technical Considerations:\n   Keeping in mind the developer's skills and the one-month timeframe, outline any technical considerations or limitations that should be taken into account during development.\n\nCompile your findings and recommendations into a structured report that covers each of the 6 sections above and a summary of your findings. Be sure to be precise and concise. Recommendations should be tangible and actionable.\n\nRemember, the game should be feasible for a single developer to build in one month with the help of generative AI coding tools. Keep your recommendations realistic within this scope.",
    "format": "plain",
    "tags": "ai,game-development,mobile,aws,frontend,consultant,development,design",
    "category": "Game Development",
    "authorEmail": "system@gravyprompts.com",
    "visibility": "public",
    "viewCount": 442,
    "useCount": 54
  },
  {
    "title": "Quantum Poker Game Development Plan",
    "content": "Create a detailed development plan for [[GAME_NAME]] with both single-player and multiplayer modes. Include the following sections:\n\n1. Game Mechanics:\n   - Core rules: Explain how traditional poker is enhanced with quantum mechanics concepts\n   - Card superposition system: How cards exist in multiple states until \"observed\"\n   - AI opponent implementation for single-player mode\n   - Multiplayer session management ensuring consistent rules\n   - Hand rankings and winning conditions\n2. Technical Architecture:\n   - AWS backend services:\n     - DynamoDB for user profiles and game state\n     - Lambda functions for game logic\n     - AppSync for real-time multiplayer functionality\n     - Cognito for user authentication\n   - Mobile implementation using React Native or Flutter\n   - Data flow diagrams and state management approach\n   - Detailed SAM template for AWS deployment\n3. Development Timeline:\n   - Week 1: Core gameplay and single-player logic\n   - Week 2: Card mechanics and UI implementation\n   - Week 3: AWS backend and multiplayer functionality\n   - Week 4: Polish, testing, and deployment\n4. Monetization Strategy:\n   - Free basic game with limited daily plays\n   - Premium card designs and table themes\n   - Tournament entry fees and structure\n   - Non-intrusive ad implementation\n5. Generative AI Integration:\n   - AI opponent using trained ML models on AWS SageMaker\n   - Card art generation using Stable Diffusion or similar\n   - Dynamic difficulty adjustment based on player skill\n6. Technical Documentation:\n   _ README.md with setup instructions\n   _ API documentation for multiplayer integration \\* Deployment guide for AWS resources\n   Include code snippets for key components: card state management system, game logic for quantum effects, and AWS service integration examples.",
    "format": "plain",
    "tags": "ai,game-development,mobile,aws,api,backend,frontend,multiplayer",
    "category": "Game Development",
    "authorEmail": "system@gravyprompts.com",
    "visibility": "public",
    "viewCount": 307,
    "useCount": 128
  },
  {
    "title": "Performance Review Template",
    "content": "<h1>Performance Review: [[employee_name]]</h1><p><strong>Review Period:</strong> [[review_period]]<br><strong>Reviewer:</strong> [[reviewer_name]]<br><strong>Date:</strong> [[review_date]]</p><h2>Overall Performance Rating</h2><p>[[overall_rating]]/5</p><h2>Key Achievements</h2><ul><li>[[achievement_1]]</li><li>[[achievement_2]]</li><li>[[achievement_3]]</li></ul><h2>Strengths</h2><p>[[strengths_description]]</p><h2>Areas for Improvement</h2><p>[[improvement_areas]]</p><h2>Goals for Next Period</h2><ol><li>[[goal_1]]</li><li>[[goal_2]]</li><li>[[goal_3]]</li></ol><h2>Development Plan</h2><p>[[development_recommendations]]</p><h2>Manager Comments</h2><p>[[manager_feedback]]</p><h2>Employee Comments</h2><p>[[employee_response]]</p>",
    "format": "html",
    "tags": "hr,performance,review,management",
    "category": "Human Resources",
    "authorEmail": "hr.manager@example.com",
    "visibility": "public",
    "viewCount": 380,
    "useCount": 140
  },
  {
    "title": "Marketing Campaign Brief",
    "content": "<h1>Campaign Brief: [[campaign_name]]</h1><h2>Campaign Overview</h2><p><strong>Campaign Period:</strong> [[start_date]] - [[end_date]]<br><strong>Budget:</strong> $[[budget_amount]]<br><strong>Campaign Manager:</strong> [[manager_name]]</p><h2>Objectives</h2><ul><li>Primary: [[primary_objective]]</li><li>Secondary: [[secondary_objective]]</li><li>KPIs: [[key_performance_indicators]]</li></ul><h2>Target Audience</h2><p><strong>Demographics:</strong> [[demographics]]<br><strong>Psychographics:</strong> [[psychographics]]<br><strong>Pain Points:</strong> [[audience_pain_points]]</p><h2>Key Messages</h2><ol><li>[[key_message_1]]</li><li>[[key_message_2]]</li><li>[[key_message_3]]</li></ol><h2>Channels & Tactics</h2><p>[[channel_strategy]]</p><h2>Creative Requirements</h2><p>[[creative_guidelines]]</p><h2>Success Metrics</h2><p>[[success_criteria]]</p>",
    "format": "html",
    "tags": "marketing,campaign,strategy,planning",
    "category": "Marketing Copy",
    "authorEmail": "marketing.lead@example.com",
    "visibility": "public",
    "viewCount": 560,
    "useCount": 210
  },
  {
    "title": "Product Description",
    "content": "<h2>[[product_name]]</h2><p><strong>Price:</strong> $[[price]]</p><p>[[product_summary]]</p><h3>Key Features:</h3><ul><li>[[feature_1]]</li><li>[[feature_2]]</li><li>[[feature_3]]</li></ul><h3>Benefits:</h3><p>[[benefit_description]]</p><h3>Technical Specifications:</h3><p>[[specifications]]</p><p><strong>Warranty:</strong> [[warranty_info]]</p>",
    "format": "html",
    "tags": "ecommerce,product,marketing",
    "category": "Marketing Copy",
    "authorEmail": "jessica@example.com",
    "visibility": "public",
    "viewCount": 340,
    "useCount": 120
  },
  {
    "title": "Sales Pitch Email",
    "content": "<p>Subject: [[compelling_subject_line]]</p><p>Hi [[prospect_name]],</p><p>I noticed that [[company_name]] is [[observation_about_company]]. Many companies in [[industry]] face similar challenges with [[pain_point]].</p><p>Our solution helps businesses like yours [[benefit_statement]]. In fact, [[similar_company]] saw [[specific_result]] after implementing our solution.</p><p>Would you be interested in a brief [[meeting_duration]]-minute call to discuss how we could help [[company_name]] achieve similar results?</p><p>Best regards,<br>[[your_name]]</p>",
    "format": "html",
    "tags": "sales,email,marketing",
    "category": "Marketing Copy",
    "authorEmail": "david@example.com",
    "visibility": "public",
    "viewCount": 445,
    "useCount": 180
  },
  {
    "title": "Social Media Post",
    "content": "<p>🎯 [[attention_grabber]]</p><p>[[main_message]]</p><p>[[call_to_action]]</p><p>[[hashtag_1]] [[hashtag_2]] [[hashtag_3]]</p><p>Link: [[link_url]]</p>",
    "format": "html",
    "tags": "social-media,marketing,content",
    "category": "Marketing Copy",
    "authorEmail": "chris@example.com",
    "visibility": "public",
    "viewCount": 1100,
    "useCount": 580
  },
  {
    "title": "LinkedIn Connection Request",
    "content": "<p>Hi [[recipient_name]],</p><p>I came across your profile while [[how_you_found_them]]. I'm particularly impressed by your work in [[specific_achievement_or_area]].</p><p>As someone who [[your_relevant_experience]], I believe we could have some valuable conversations about [[mutual_interest_topic]].</p><p>I'd love to connect and learn more about your experience with [[specific_topic]]. Perhaps we could [[suggested_action]]?</p><p>Looking forward to connecting!</p><p>Best regards,<br>[[your_name]]</p>",
    "format": "html",
    "tags": "linkedin,networking,professional,social",
    "category": "Professional Networking",
    "authorEmail": "networker@example.com",
    "visibility": "public",
    "viewCount": 920,
    "useCount": 380
  },
  {
    "title": "User Story Template",
    "content": "<h2>User Story: [[story_title]]</h2><p><strong>Story ID:</strong> [[story_id]]<br><strong>Priority:</strong> [[priority_level]]<br><strong>Story Points:</strong> [[story_points]]</p><h3>As a...</h3><p>[[user_role]]</p><h3>I want to...</h3><p>[[user_goal]]</p><h3>So that...</h3><p>[[user_benefit]]</p><h3>Acceptance Criteria</h3><ul><li>Given [[given_context]], when [[action_taken]], then [[expected_result]]</li><li>[[additional_criteria_1]]</li><li>[[additional_criteria_2]]</li></ul><h3>Technical Notes</h3><p>[[technical_considerations]]</p><h3>Dependencies</h3><p>[[dependencies]]</p>",
    "format": "html",
    "tags": "agile,scrum,project-management,development",
    "category": "Project Management",
    "authorEmail": "scrum.master@example.com",
    "visibility": "public",
    "viewCount": 680,
    "useCount": 290
  },
  {
    "title": "Research Summary Template",
    "content": "<h1>Research Summary: [[topic]]</h1><h2>Objective</h2><p>[[research_objective]]</p><h2>Key Findings</h2><ol><li>[[finding_1]]</li><li>[[finding_2]]</li><li>[[finding_3]]</li></ol><h2>Methodology</h2><p>[[methodology_description]]</p><h2>Implications</h2><p>[[implications]]</p><h2>Recommendations</h2><p>[[recommendations]]</p><h2>References</h2><p>[[references]]</p>",
    "format": "html",
    "tags": "research,academic,analysis",
    "category": "Research",
    "authorEmail": "maria@example.com",
    "visibility": "public",
    "viewCount": 450,
    "useCount": 160
  },
  {
    "title": "Error Message Template",
    "content": "<div class=\"error-container\"><h2>[[error_title]]</h2><p class=\"error-code\">Error Code: [[error_code]]</p><p class=\"error-message\">[[user_friendly_message]]</p><div class=\"error-details\"><h3>What happened?</h3><p>[[error_explanation]]</p><h3>What can you do?</h3><ul><li>[[suggestion_1]]</li><li>[[suggestion_2]]</li><li>[[suggestion_3]]</li></ul></div><div class=\"error-actions\"><button>[[primary_action_text]]</button><a href=\"[[help_link]]\">Get Help</a></div><p class=\"error-footer\">If the problem persists, please contact [[support_contact]]</p></div>",
    "format": "html",
    "tags": "ux,error-handling,user-experience,frontend",
    "category": "UX Writing",
    "authorEmail": "ux.writer@example.com",
    "visibility": "public",
    "viewCount": 420,
    "useCount": 180
  }
]